tgv2dTests/tgv2d_temporal/pimple/pimple_nu0.0000001/TGV_temporal/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    UFinal
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }
}
PIMPLE
{
	nOuterCorrectors 1;
	nCorrectors 	4;
	nNonOrthogonalCorrectors 0;
	pRefPoint	(0.0 1.57079632679 -0.05);
	pRefValue	0.0;
}



// ************************************************************************* //
